api-mode-practice/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    users = User.all

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "\"hoge\""], ["created_at", "2022-01-04 07:38:45.445336"], ["updated_at", "2022-01-04 07:38:45.445336"]]
---
  def create
    user = User.new(user_params)
    if user.save